---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.GetSpecTypeId
source: html/dbd738d0-9b8b-4792-34a9-5b64a1063083.htm
---
# Autodesk.Revit.DB.ScheduleField.GetSpecTypeId Method

The spec describing values of this field, if applicable.

## Syntax (C#)
```csharp
public ForgeTypeId GetSpecTypeId()
```

## Returns
Identifier of the spec, or empty if the field does not represent a number with units.